In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

<center>
<img src="../../img/ods_stickers.jpg">
## Открытый курс по машинному обучению. Сессия № 2
</center>
Автор материала: программист-исследователь Mail.ru Group, старший преподаватель Факультета Компьютерных Наук ВШЭ Юрий Кашницкий. Материал распространяется на условиях лицензии [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/). Можно использовать в любых целях (редактировать, поправлять и брать за основу), кроме коммерческих, но с обязательным упоминанием автора материала.

# <center>Тема 1. Первичный анализ данных с Pandas</center>
## <center>Практическое задание. Анализ данных пассажиров "Титаника"</center>

**Заполните код в клетках (где написано "Ваш код здесь") и ответьте на вопросы в [веб-форме](https://goo.gl/SbRcpW).**

In [ ]:
import numpy as np
import pandas as pd

%matplotlib inline

**Считаем данные из файла в память в виде объекта Pandas.DataFrame**

In [3]:
data = pd.read_csv("/content/drive/MyDrive/Datasets/titanic_train.csv", index_col="PassengerId")

**Данные представлены в виде таблицы. Посмотрим на первые 5 строк:**

In [4]:
data.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

**Для примера отберем пассажиров, которые сели в Cherbourg (Embarked=C) и заплатили более 200 у.е. за билет (fare > 200).**

Убедитесь, что Вы понимаете, как эта конструкция работает. <br>
Если нет – посмотрите, как вычисляется выражение в квадратных в скобках.

In [6]:
data[(data["Embarked"] == "C") & (data.Fare > 200)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,C82,C

**Можно отсортировать этих людей по убыванию платы за билет.**

In [7]:
data[(data["Embarked"] == "C") & (data["Fare"] > 200)].sort_values(
    by="Fare", ascending=False
).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C

**Пример создания признака.**

In [8]:
def age_category(age):
    """
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    """
    if age < 30:
        return 1
    elif age < 55:
        return 2
    else:
        return 3

In [9]:
age_categories = [age_category(age) for age in data.Age]

In [10]:
data["Age_category"] = age_categories

**Другой способ – через `apply`.**

In [11]:
data["Age_category"] = data["Age"].apply(age_category)

**1. Сколько мужчин / женщин находилось на борту?**
- 412 мужчин и 479 женщин
- 314 мужчин и 577 женщин
- 479 мужчин и 412 женщин
- 577 мужчин и 314 женщин

In [12]:
female = data[(data["Sex"] == "female")].count #314
male = data[(data["Sex"] == "male")].count #577
print(male, female)

<bound method DataFrame.count of              Survived  Pclass                            Name   Sex   Age  \
PassengerId
1                   0       3         Braund, Mr. Owen Harris  male  22.0
5                   0       3        Allen, Mr. William Henry  male  35.0
6                   0       3                Moran, Mr. James  male   NaN
7                   0       1         McCarthy, Mr. Timothy J  male  54.0
8                   0       3  Palsson, Master. Gosta Leonard  male   2.0
...               ...     ...                             ...   ...   ...
884                 0       2   Banfield, Mr. Frederick James  male  28.0
885                 0       3          Sutehall, Mr. Henry Jr  male  25.0
887                 0       2           Montvila, Rev. Juozas  male  27.0
890                 1       1           Behr, Mr. Karl Howell  male  26.0
891                 0       3             Dooley, Mr. Patrick  male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked  \
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
5                0      0            373450   8.0500   NaN        S
6                0      0            330877   8.4583   NaN        Q
7                0      0             17463  51.8625   E46        S
8                3      1            349909  21.0750   NaN        S
...            ...    ...               ...      ...   ...      ...
884              0      0  C.A./SOTON 34068  10.5000   NaN        S
885              0      0   SOTON/OQ 392076   7.0500   NaN        S
887              0      0            211536  13.0000   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

             Age_category
PassengerId
1                       1
5                       2
6                       3
7                       2
8                       1
...                   ...
884                     1
885                     1
887                     1
890                     1
891                     2

[577 rows x 12 columns]> <bound method DataFrame.count of              Survived  Pclass  \
PassengerId
2                   1       1
3                   1       3
4                   1       1
9                   1       3
10                  1       2
...               ...     ...
881                 1       2
883                 0       3
886                 0       3
888                 1       1
889                 0       3

                                                          Name     Sex   Age  \
PassengerId
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
10                         Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
...                                                        ...     ...   ...
881               Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0
883                               Dahlberg, Miss. Gerda Ulrika  female  22.0
886                       Rice, Mrs. William (Margaret Norton)  female  39.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN

             SibSp  Parch            Ticket     Fare Cabin Embarked  \
PassengerId
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
9                0      2            347742  11.1333   NaN        S
10               1      0            237736  30.0708   NaN        C
...            ...    ...               ...      ...   ...      ...
881              0      1            230433  26.0000   NaN        S
883              0      0              7552  10.5167   NaN        S
886              0      5            382652  29.1250   NaN        Q
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S

             Age_category
PassengerId
2                       2
3                       1
4                       2
9                       1
10                      1
...                   ...
881                     1
883                     1
886                     2
888                     1
889                     3

[314 rows x 12 columns]>

**2. Выведите распределение переменной `Pclass` (социально-экономический статус) и это же распределение, только для мужчин / женщин по отдельности. Сколько было мужчин 2-го класса?**
- 104
- 108
- 112
- 125

In [25]:
data[(data["Sex"] == "male") & (data["Pclass"] == 2)].count #108

<bound method DataFrame.count of              Survived  Pclass                           Name   Sex   Age  \
PassengerId
18                  1       2   Williams, Mr. Charles Eugene  male   NaN
21                  0       2           Fynney, Mr. Joseph J  male  35.0
22                  1       2          Beesley, Mr. Lawrence  male  34.0
34                  0       2          Wheadon, Mr. Edward H  male  66.0
71                  0       2     Jenkin, Mr. Stephen Curnow  male  32.0
...               ...     ...                            ...   ...   ...
849                 0       2              Harper, Rev. John  male  28.0
862                 0       2    Giles, Mr. Frederick Edward  male  21.0
865                 0       2         Gill, Mr. John William  male  24.0
884                 0       2  Banfield, Mr. Frederick James  male  28.0
887                 0       2          Montvila, Rev. Juozas  male  27.0

             SibSp  Parch            Ticket  Fare Cabin Embarked  Age_category
PassengerId
18               0      0            244373  13.0   NaN        S             3
21               0      0            239865  26.0   NaN        S             2
22               0      0            248698  13.0   D56        S             2
34               0      0        C.A. 24579  10.5   NaN        S             3
71               0      0        C.A. 33111  10.5   NaN        S             2
...            ...    ...               ...   ...   ...      ...           ...
849              0      1            248727  33.0   NaN        S             1
862              1      0             28134  11.5   NaN        S             1
865              0      0            233866  13.0   NaN        S             1
884              0      0  C.A./SOTON 34068  10.5   NaN        S             1
887              0      0            211536  13.0   NaN        S             1

[108 rows x 12 columns]>

**3. Каковы медиана и стандартное отклонение платежей (`Fare`)? Округлите до 2 десятичных знаков.**
- Медиана – 14.45, стандартное отклонение – 49.69
- Медиана – 15.1, стандартное отклонение – 12.15
- Медиана – 13.15, стандартное отклонение – 35.3
- Медиана – 17.43, стандартное отклонение – 39.1

In [136]:
new_data = data.sort_values(by="Fare").reset_index()
np.round(np.median(new_data.Fare), 2) #медиана=14.45
np.round(np.std(new_data.Fare), 2) #стандартное отклонение=49.67

49.67

**4. Правда ли, что люди моложе 30 лет выживали чаще, чем люди старше 60 лет? Каковы доли выживших в обеих группах?**
- 22.7% среди молодых и 40.6% среди старых
- 40.6% среди молодых и 22.7% среди старых
- 35.3% среди молодых и 27.4% среди старых
- 27.4% среди молодых и 35.3% среди старых

In [128]:
np.round((data[(data["Survived"] == 1) & (data["Age"] < 30)].Name.count()) * 100 / (data[(data["Age"] < 30)].Name.count()), 1) #молодые=40.6
np.round((data[(data["Survived"] == 1) & (data["Age"] > 60)].Name.count()) * 100 / (data[(data["Age"] > 60)].Name.count()), 1) #старые=22.7

22.7

**5. Правда ли, что женщины выживали чаще мужчин? Каковы доли выживших в обеих группах?**
- 30.2% среди мужчин и 46.2% среди женщин
- 35.7% среди мужчин и 74.2% среди женщин
- 21.1% среди мужчин и 46.2% среди женщин
- 18.9% среди мужчин и 74.2% среди женщин

In [130]:
np.round((data[(data["Survived"] == 1) & (data["Sex"] == 'male')].Name.count()) * 100 / (data[(data["Sex"] == 'male')].Name.count()), 1) #мужчины=18.9
np.round((data[(data["Survived"] == 1) & (data["Sex"] == 'female')].Name.count()) * 100 / (data[(data["Sex"] == 'female')].Name.count()), 1) #женщины=74.2

74.2

**6. Найдите самое популярное имя среди пассажиров Титаника мужского пола?**
- Charles
- Thomas
- William
- John

In [131]:
# Ваш код здесь

**7. Сравните графически распределение стоимости билетов и возраста у спасенных и у погибших. Средний возраст погибших выше, верно?**
- Да 
- Нет

In [142]:
np.mean(data[(data["Survived"] == 0)].Age) > np.mean(data[(data["Survived"] == 1)].Age)

True

**8. Как отличается средний возраст мужчин / женщин в зависимости от класса обслуживания? Выберите верные утверждения:**
- В среднем мужчины 1-го класса старше 40 лет
- В среднем женщины 1-го класса старше 40 лет
- Мужчины всех классов в среднем старше женщин того же класса
- В среднем люди в 1 классе старше, чем во 2-ом, а те старше представителей 3-го класса

In [150]:
np.mean(data[(data["Sex"] == "male") & (data["Pclass"] == 1)].Age) > 40 #True
np.mean(data[(data["Sex"] == "female") & (data["Pclass"] == 1)].Age) > 40 #False
np.mean(data[(data["Sex"] == "male")].Age) > np.mean(data[(data["Sex"] == "female")].Age) #True
np.mean(data[(data["Pclass"] == 1)].Age) > np.mean(data[(data["Pclass"] == 2)].Age) > np.mean(data[(data["Pclass"] == 3)].Age) #True

True